``` ─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route53_record.jenkins-workers-gold[0] will be updated in-place
  ~ resource "aws_route53_record" "jenkins-workers-gold" {
        id              = "Z386N8B8JBC6TQ_worker-0.gold.build.galaxyproject.eu_A"
        name            = "worker-0.gold.build.galaxyproject.eu"
      ~ records         = [
          - "10.5.68.180",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_route53_record.jenkins-workers-silver[0] will be updated in-place
  ~ resource "aws_route53_record" "jenkins-workers-silver" {
        id              = "Z386N8B8JBC6TQ_worker-0.silver.build.galaxyproject.eu_A"
        name            = "worker-0.silver.build.galaxyproject.eu"
      ~ records         = [
          - "10.5.68.46",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # openstack_compute_instance_v2.jenkins-workers-gold[0] must be replaced
-/+ resource "openstack_compute_instance_v2" "jenkins-workers-gold" {
      ~ access_ip_v4        = "10.5.68.180" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "d324e8d9-8a15-4a54-ae60-440767bbab53" -> (known after apply)
      ~ id                  = "e2bffb88-01c6-4331-884c-39b7195d164f" -> (known after apply)
      ~ image_id            = "814eece8-45fe-43b6-88ed-02c5a3b35303" -> (known after apply)
      ~ image_name          = "jenkins-worker-v60-j66-5f3adb0e100c-main" -> "jenkins-worker-v60-j105-d1dfcf46c4cd-main" # forces replacement
        name                = "worker-0.gold.build.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
        # (7 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "10.5.68.180" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:d7:37:6e" -> (known after apply)
            name           = "bioinf"
          + port           = (known after apply)
          ~ uuid           = "7de249b6-6d32-44e3-b50c-291939868d2f" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # openstack_compute_instance_v2.jenkins-workers-silver[0] must be replaced
-/+ resource "openstack_compute_instance_v2" "jenkins-workers-silver" {
      ~ access_ip_v4        = "10.5.68.46" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "d324e8d9-8a15-4a54-ae60-440767bbab53" -> (known after apply)
      ~ id                  = "bf0e9565-4293-43fa-b762-7943c43d80c9" -> (known after apply)
      ~ image_id            = "814eece8-45fe-43b6-88ed-02c5a3b35303" -> (known after apply)
      ~ image_name          = "jenkins-worker-v60-j66-5f3adb0e100c-main" -> "jenkins-worker-v60-j105-d1dfcf46c4cd-main" # forces replacement
        name                = "worker-0.silver.build.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
        # (7 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "10.5.68.46" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:27:01:bf" -> (known after apply)
            name           = "bioinf"
          + port           = (known after apply)
          ~ uuid           = "7de249b6-6d32-44e3-b50c-291939868d2f" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # openstack_compute_volume_attach_v2.jenkins-workers-gold-va[0] must be replaced
-/+ resource "openstack_compute_volume_attach_v2" "jenkins-workers-gold-va" {
      ~ device      = "/dev/vdb" -> (known after apply)
      ~ id          = "e2bffb88-01c6-4331-884c-39b7195d164f/8db29e86-cb8c-451d-a2f0-a5b02332ba3e" -> (known after apply)
      ~ instance_id = "e2bffb88-01c6-4331-884c-39b7195d164f" -> (known after apply) # forces replacement
      ~ region      = "Freiburg" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # openstack_compute_volume_attach_v2.jenkins-workers-silver-va[0] must be replaced
-/+ resource "openstack_compute_volume_attach_v2" "jenkins-workers-silver-va" {
      ~ device      = "/dev/vdb" -> (known after apply)
      ~ id          = "bf0e9565-4293-43fa-b762-7943c43d80c9/5a8009f3-4007-45f1-98eb-50634d8dbc51" -> (known after apply)
      ~ instance_id = "bf0e9565-4293-43fa-b762-7943c43d80c9" -> (known after apply) # forces replacement
      ~ region      = "Freiburg" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 4 to add, 2 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```